/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "無法完成操作";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "發生未知的錯誤 (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "無法完成動作";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "請稍後再試。";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "無法錄製";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "無法錄製";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "停止其他使用“%@”的動作，然後再試一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "無法錄製";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "可用空間不足，無法繼續寫入檔案。請刪除現有的視訊或照片來清出空間。";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "已達到此錄製項目的最大長度限制。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "已達到此錄製項目的最大尺寸限制。"; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "停止其他使用錄製設備的動作，然後再試一次。";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "已達到此錄製項目的最大長度限制。"; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "無法錄製";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "請再試著錄製一次。";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "無法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "停止其他使用“%@”的動作，然後再試一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "無法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "停止其他使用“%@”的動作，然後再試一次。"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "停止錄製";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "停止其他使用錄製設備的動作，然後再試一次。";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "無法完成動作";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "請稍後再試。";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "無法完成輸出";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "請再試著輸出一次";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "無法解碼";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "無法解碼媒體資料。可能已損毀。";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "不支援此媒體格式。";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "無法儲存";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "請再試著儲存一次。";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "無法使用此媒體。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "無法使用此媒體。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "無法使用此媒體。";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "無法使用此媒體。";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "不支援此媒體格式。";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "此媒體可能已損毀。";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "無法拍攝照片";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "請再試著拍攝一次照片。";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "版權保護的內容不支援此操作。"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "此內容未經授權。"; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "此應用程式未被授權播放此檔案。"; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "無法使用此媒體。";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "無法解碼";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "找不到此媒體所需的解碼器。";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "無法編碼";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "找不到此媒體所需的編碼器。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "無法解碼";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "此媒體所需的解碼器忙碌中。";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "停止其他解碼媒體的動作，然後再試一次。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "無法編碼";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "此媒體所需的編碼器忙碌中。";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "停止其他編碼媒體的動作，然後再試一次。";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "無法使用“%@”"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "在幕後執行的應用程式可能無法使用“%@”。"; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "此媒體不支援此操作。";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "無法根據提供的指示處理視訊。";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "無法打開";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "無法使用此媒體。";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "操作停止";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "無法使用下載目標 URL 的快取檔案。";
